benchmarks/incompressible/pimpleHFDIBFoam/settling_benchmark/10_settling_base_case/Allrun.sh
#!/bin/bash

. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0

cp -r 0.org 0

paraFoam -touch
paraFoam -builtin -touch


runApplication blockMesh
runApplication decomposePar -force
application=`getApplication`

# runApplication $application
runParallel $application

# runApplication reconstructPar 


# ----------------------------------------------------------------- end-of-file
